In [1]:
import pandas as pd

In [7]:
log = pd.read_csv('log.csv.xls',header=0)

In [8]:
log.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 4 columns):
Запись пользователя № - user_919    999 non-null object
[2019-01-01 14:06:51                984 non-null object
Unnamed: 2                          485 non-null float64
Unnamed: 3                          138 non-null float64
dtypes: float64(2), object(2)
memory usage: 31.3+ KB

In [27]:
log.columns = ['user_id','time','bet','win']

In [28]:
log

                              user_id                  time       bet      win
0    Запись пользователя № - user_973  [2019-01-01 14:51:16       NaN      NaN
1    Запись пользователя № - user_903  [2019-01-01 16:31:16       NaN      NaN
2    Запись пользователя № - user_954  [2019-01-01 17:17:51       NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 21:31:18       NaN      NaN
4    Запись пользователя № - user_917  [2019-01-01 23:34:55  156789.0      NaN
..                                ...                   ...       ...      ...
994  Запись пользователя № - user_984   [2019-04-20 9:59:58    9754.0      NaN
995                            #error                   NaN   10054.0  29265.0
996                            #error                   NaN   10454.0      NaN
997                            #error                   NaN    1000.0      NaN
998                            #error                   NaN   10754.0      NaN

[999 rows x 4 columns]

In [ ]:
log[log['user_id']]

In [46]:
log = pd.read_csv("log.csv.xls",header=None)
log.columns = ['user_id','time', 'bet','win']

In [47]:
log_win = log[log['win']>0]

In [48]:
win_count = len(log_win)

In [49]:
win_count

138

# Users

In [37]:
users = pd.read_csv('users.csv.xls',encoding='koi8-R',sep='\t')

In [39]:
users.columns = ['user_id','email','geo']

# sample

In [40]:
sample = pd.read_csv('sample.csv.xls')

In [41]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
Name          10 non-null object
City          10 non-null object
Age           11 non-null int64
Profession    11 non-null object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

In [42]:
sample['Name'].unique()

array(['Иванов', nan, 'sidorov', '_______', 'Кузнецов', 'Сажин',
       'Котлеревский', 'Завалишина', 'Левина', 'Фикс'], dtype=object)

In [43]:
sample['City']

0          Москва
1       Волгоград
2          Москва
3     Владивосток
4           Курск
5            Сочи
6          Сургут
7      Йошкар-Ола
8       Чебоксары
9             NaN
10           Рига
Name: City, dtype: object

In [44]:
sample2 = sample[sample['Age']<30]

In [52]:
sample = pd.read_csv("sample.csv.xls")
sample2 = sample[(sample['Age']<30)&(sample['Profession']=='Рабочий')]

In [53]:
sample2

       Name    City  Age Profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий